Tekla Open API Reference for Tekla Structures 2025
TeklaDrawingColor Constructor
Overload List
Name | Description
TeklaDrawingColor()
 Default constructor for the struct. Assigns color to standard black.
TeklaDrawingColor(Color)
 Construct a TeklaDrawingColor instance by passing in an RGB System.Drawing.Color value. This is the safe non-throwing constructor to use.
TeklaDrawingColor(DrawingColors)
 Construct a TeklaDrawingColor instance by passing in a Tekla standard color enum value. Use of this constructor is discouraged, please use TeklaDrawingColor(Color RGB)
TeklaDrawingColor(DrawingHatchColors)
 Construct a TeklaDrawingColor instance by passing in a Tekla standard color hatch enum value. Use only for hatches.
Top
See Also
Reference
TeklaDrawingColor Structure
Tekla.Structures.Drawing Namespace